Repository: mozilla-l10n/mt-training-data
Catalog: nyu/nyu_pontoon.tmx
Source language: en_us
Languages: nyu

source: 1 sentence collected
nyu: Nfolo-fala omwe mudabweresa

source: 2 down, keep it up!<playIcon></playIcon>
nyu: 2 Mbatitomeni ayayi lede <playIcon></playIcon> , pitirizani tenepa!

source: About
nyu: Mphangwa

source: Accepted file types: .tsv only
nyu: Mitundu ya sagudhu ya mphangwa yomwe inabvumiwa: inabvumiwa ndi ixi basi .tsv

source: { $actionType }<playIcon></playIcon> did they accurately speak the sentence?
nyu: { $actionType }<playIcon></playIcon> Nfolo-fala warengedwa mwa bwinobwino?

source: { $actionType }<recordIcon></recordIcon> then read the sentence aloud
nyu: { $actionType }<recordIcon></recordIcon> mungamala werengani nfolo-fala mwakukuwa

source: { $actionType }<stopIcon></stopIcon> when done
nyu: { $actionType } <stopIcon></stopIcon> Ungakhala wamaliza

source: { $actionType } submit when ready
nyu: { $actionType } Tumizani mungakhala mwamala

source: Add and Review Sentences, Add Questions, Transcribe Audio
nyu: Kuyikha na kubwerezera mifolo-fala, kuyikha mibvundzo na kunemba piwomwe pidalewedwa nkaseti

source: Add <icon></icon> a public domain sentence
nyu: Nembani <icon></icon> nfolo-fala yomwe ungadziwike na wanthu wense

source: Add information
nyu: Kuyikha mphangwa

source: Add new sentences for the community to read
nyu: Kuyikha mifolo-fala inango ayayi ipsa kuti wanthu wa ncisa awerenge

source: Add one sentence per line
nyu: Ikha nfolo-fala ubodzi pathemba

source: Add questions
nyu: Kuyikha mibvundzo mubzilewedwe bzace

source: Add sentences
nyu: Kuyikha mifo-fala mubzilewedwe bzace

source: Add Sentences
nyu: Ikha mifolo-fala

source: Add up to 1,000 sentences
nyu: Ikha mifolo-fala yomwe ingafikirane 1000

source: Add Your Voice
nyu: Ikha fala yako

source: Agriculture and Food
nyu: Za ulimi na zakudya

source: All sentence must have the same domain
nyu: Mifolo-fala yense njakufunika kuti ikhale alikulewa bzinthu bzakulingirirane ayayi bzomwe bzikucita mbali ibodzi

source: All sentences must have the same citation
nyu: Mifolo-fala yense ikhale yomwe idatengiwa ayayi kucosiwa kumbuto ibodzibodzi

source: Already have an account? <login>Log-In</login>
nyu: Mudabzinembesa kale? <login>Pitani na umu</login>

source: An error occurred fetching sentences
nyu: Pakuwoneka kuphonyeka pakusaka mifolo-fala

source: An error occurred reviewing this sentence
nyu: Pakuwoneka kuphonyeka pakubwerezera mifolo-fala

source: An error occurred submitting your voice information
nyu: Pawoneka kuphonyeka pomwe mukhatumiza mhpangwa zanu za fala

source: Approve
nyu: Kubvumiza

source: A quiet background hubbub is OK, but we don’t want additional voices that may cause a machine algorithm to identify words that are not in the written text. If you can hear distinct words apart from those of the text, the clip should be rejected. Typically this happens where the TV has been left on, or where there is a conversation going on nearby.
nyu: Kubveka kwa kukuwa kwa anthu kutalitali palibe bvuto, koma tinafuna lini kubva baludya inango yomwe ingacitise kuti logaritimo ya nchini ya kukoya fala ikhonde kukoya mafala yomwe anembedwa patsamba. Imwe mungakwanisa kubva mafala yomwe adasiyana na yomwe ali patsamba, kaseti tenki kulambiya. Bzinthu ninga ibzi bzimbacitika pangakhala kuti televisawu ya siyiwa idaliziwa penu pakuceza abthu pafupi.

source: Are you coming? <strong>[called by another]</strong>
nyu: Imwe mukubwera? <strong>[kucemeriwa na unango]</strong>

source: Ask us questions on <matrixLink>Matrix</matrixLink>, <discourseLink>Discourse</discourseLink> or <emailLink>email</emailLink>.
nyu: Ticiteni mibvundzo mu <matrixLink>Matirijhi</matrixLink>, <discourseLink>mafala</discourseLink></discourseLink> ayayi <emailLink>email</emailLink>.

source: Automotive and Transport
nyu: Kanderendere na bzakufambira

source: Background Noise
nyu: Kunyangula kwa kutali

source: Background Voices
nyu: Kubveka kwa mafala kutalitali

source: Be cautious before rejecting a clip on the ground that the reader has mispronounced a word, has put the stress in the wrong place, or has apparently ignored a question mark. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a margin of appreciation for those who may speak differently from you.
nyu: Wonesesa mwa bwino pomwe ungafuna kulamba kaseti ungawona malewedwe womwe mulewi alewa, kuphonyeka kwa fala, alewa mwabwino mbuto yomwe ndiyo lini pinango alibe kuteweza nthotho. Pasawoneka bzinthu bzakusiyanasiyana bzomwe bzakuphatisa basa ya kubva mudziko lense, pinango bzingakhale bzinthu ayaayi mafala yomwe imwe mukanati kubva kale mucisa mwanu. Tetekerani wale womwe angalewe mwakusiyana na imwe na thangwera ya wanthu ambalewalewa mwakusiyanasiyana.

source: [‘Beret’ is OK whether with stress on the first syllable (UK) or the second (US)]
nyu: [Wa mpfungula mulomo atona ku Brasil ambawerengiwa (mulumbwana, capewu), koma ku Portugal ambawengiwa (m'lumbwana, capewu)]

source: <bold>{ $count }</bold> Clips
nyu: <bold>{ $count }</bold> makaseti

source: <bold>Help us</bold> find more voices
nyu: <bold>Tithandizeni</bold> Kuti tigumane mafala anango.

source: Bulk batch
nyu: Gulu ikulu

source: Bulk Sentences Uploaded
nyu: Gulu ya mifolo-fala yatumizidwa

source: By telling us about yourself, you will help developers build more inclusive technology
nyu: Mukufuna kulewa bzinthu bozmwe imwe mumbalewera cilewedwe canu?

source: By using Common Voice, you agree to our <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
nyu: Kuphatisa basa Common Voice, imwe mudabvuma<termsLink>Maphatiro</termsLink> na <privacyLink>cintsintsi na maphatidwe ya mabasa wathu</privacyLink>

source: Cancel Re-recording
nyu: Kukoyiwa kwa fala mugwangwa kwakhala kwakuthamanga

source: Cancel Submission
nyu: Kuyimisa kutumiza

source: Cannot submit more than 1000 sentences
nyu: Lekani kutumiza mifolo-fala ya kupitirira 1000

source: Change preferences
nyu: Kucinja piyomwe ndi piyakufunika

source: Check <icon></icon> is this a linguistically correct sentence?
nyu: Mwawona<icon></icon> ngati nfolo-falawo wanembiwa mwa bwinobwino?

source: <chevron></chevron>See less
nyu: <chevron></chevron>Onani pang‘ono

source: <chevron></chevron>See more
nyu: <chevron></chevron>Onani pomwe

source: Citation
nyu: Kulewa komwe mudatenga mphangwa

source: Cite with a URL link or the full name of the work.
nyu: Lewani mu linki ya URL ayayi dzina ya livu yomwe mudatenga mifolo-fala.

source: Click
nyu: Tinya apa

source: Clips Uploaded
nyu: Kubulusa makaseti yomwe adakoyiwa

source: Comment
nyu: Malewedwe

source: Contact Us
nyu: Lewani na ife

source: Continue
nyu: Kupitiriza

source: Continue validating
nyu: Kupitiriza kubvumiza

source: Contribute
nyu: Thandiza

source: Contribute sentences
nyu: Thandizani na mifolo-fala

source: Contribution Criteria
nyu: Masankhuliro ya muthandizi

source: Create a profile
nyu: Bzinembeseni dzina lanu

source: Criteria
nyu: Masankhuliro

source: Datasets
nyu: Gulu la bzinthu bza mphagwa

source: Delete my recordings
nyu: Kupfudza makaseti yanga

source: Different language
nyu: Cilewedwe cinango

source: Difficult to pronounce
nyu: Kutaza kulewalewa

source: Discard ongoing recording
nyu: Kuyimisa kukoya fala yomwe ikuyikhiwa mukaseti

source: Does the sentence meet the guidelines?
nyu: Nfolo-fala ukutoweza masankhuliro?

source: Donate your voice
nyu: Pereka fala yako

source: Don't see your language on Common Voice yet?
nyu: Cilewedwe canu cikanati kuyikhiwa mu Commn Voice ?

source: Drag your file here or <uploadButton>click to upload</uploadButton>
nyu: Fambisani thumba ya mphangwa yanu mpaka apa ayayi <uploadButton>tinyani kuti mutumize</uploadButton>

source: Drop file here to upload
nyu: Fambisani sagudhu ya mphangwa yanu mpaka apa kuti mutumize

source: Enter your public domain sentence here
nyu: Nemba apa fala yanu yomwe ingadziwiwe na wanthu wense

source: Enter your public domain sentences here
nyu: Nemba apa mifolo-fala yanu yomwe ingadziwiwe na wanthu wense

source: Error adding sentence
nyu: Kuphonyeka kwa kuyikhwa kwa nfolo-fala

source: Exit & Delete clips
nyu: Kucoka na kupfudza mifolo-fala

source: Fewer than 15 words per sentence
nyu: Yakusaya kufikira mafala 15

source: File is too large
nyu: Sagudhu ya mphangwa njikulu kwenekwene

source: File is too small
nyu: Sagudhu ya mphangwa njing'ono kwenekwene

source: Finance
nyu: Mbali ya kobiri

source: Finish recording
nyu: Kumaliza kukoya fala nkaseti

source: Finish recording first?
nyu: Payambiwe kumaliziwa kokoyiwa kwa kaseti?

source: Finish Review
nyu: Kumaliza kubwerezera

source: Finish validating
nyu: Kubvumiza mawerengedwe

source: Finish validating clips?
nyu: Kumaliza kubvumiza kaseti?

source: Follow guidelines from “What sentences can I add?”
nyu: Tewezera maphatiro ya basa yomwe ikulewa“Mifolo-fala iponi yomwe ndikhayikhe?”

source: for example
nyu: Kuyezeza nkudinga

source: For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. For example, if we don't include any speakers with a particular accent, then the technology won't work well for people with that accent. <learnMore>Learn more about why metadata matters.</learnMore>
nyu: Kuti tekinolohjiya iphate basa mwan bwinobwino, ndi piyakufunika kwenekwene kuti mphangwa zomwe tinazitengazi zingakhele mphangwa zomwe zinabweresiwa na anthu azinji wakusiyanasiyana. Kuyezeza nkudinga, mbambafunika lini walewi womwe ambalewa mwakunyada, tekinolojhiya imbafuna lini wanthu womwe ambalewa tenepayi . <learnMore>Dziwa pomwe bzakufunikira za mphangwa na mphangwa.</learnMore>

source: General
nyu: Mbali ya piwonsene

source: General language / multiple variants
nyu: Cilewedwe cayico/ ciweledwe comwe cina tulewedwe takusiyanasiyana

source: Grammatical / spelling error
nyu: Kuphonyeka kwa kanembedwe ka mafala

source: Great!<recordIcon></recordIcon> Record your next clip
nyu: Bzabwino! <recordIcon></recordIcon> Koyani fala nkaseti panfolo-fala unangowu

source: Great work!<playIcon></playIcon> Listen again when you're ready
nyu: Basa la didi! <playIcon></playIcon> Bvaya pomwe ungakhala unfuna kutoma basa

source: Guidelines
nyu: Tsamba ya kaphatidwe ka basa

source: Healthcare
nyu: Mbali za ulapi

source: Help create Common Voice’s first target segment in { $locale }
nyu: Tithandizeni kuti tikondze kafala kakutoma ka Common Voice umu { $locale }

source: Help us validate voices
nyu: Tithandize kuvumiza mafala

source: His hand was rais-ed.
nyu: M'manja ako alamuka.

source: History, Law and Government
nyu: Bzidapi, ufulu na kutonga

source: How do I cite?
nyu: Mungacite tani kuti muyikhe ayayi mulewe komwe mudatenga mphangwa?

source: How to add multiple sentences
nyu: Mayikidwe ya mifolo-fala izinji

source: How would you describe your sex or gender?
nyu: Imwe ndimwe munthu wa cikazi ayayi cimuna?

source: I agree
nyu: Ndinabvuma

source: I confirm that these sentence are <wikipediaLink>public domain</wikipediaLink> and I have permission to upload them.
nyu: Ande mifolo-falayi nja<wikipediaLink>kudziwika na mbumba</wikipediaLink> ndipo ndidabvumizidwa kuti nditumize.

source: I confirm that this sentence is <wikipediaLink>public domain</wikipediaLink> and I have permission to upload it.
nyu: Ande nfolo-fala uwu ndi wa <wikipediaLink>ndi wakudziwika na wanthu wense</wikipediaLink> ndipo ndidabvumizidwa kuti ndi tumize.

source: <icon></icon> Add multiple public domain sentences
nyu: <icon></icon> Kuyikha mifolo-fala yomwe imbadziwika na mbumba

source: Ideally natural and conversational (it should be easy to read the sentence)
nyu: Mafala yomwe ndi ya kubadwa ayayi ya masendzeko (akhale nfolo-fala wa kupusa kuwerenga ayayi akhale wa kuwerengeka)

source: I do not agree
nyu: Ndinabvuma lini

source: If it’s your own words, just say <italicizedText>“Self Citation”</italicizedText>. We need to know where you found this content so that we can check it is in the public domain and no copyright restrictions apply. For more information about citation see our <guidelinesLink>Guidelines page</guidelinesLink>.
nyu: Angakhala ndi mafala yanu, lewani tere <italicizedText>“Mafala yangu”</italicizedText> Tinafuna kudziwa komwe mudawona ayayi mudawatenga mafalayo kuti mudziwe kuti ndi mafala yomwe ndi yakudziwika na mbumba ayayi na wanthu wense yomwe anafunika lini kulewa komwe adatengiwa ayayi kulewa munikaciro mafalaya. Sakani kudziwa mphangwa zomwe ndi za kutenga mphangwa kunango umu <guidelinesLink>tsamba ya kaphatidwe ka basa</guidelinesLink>.

source: If the recording breaks up, or has crackles, reject unless the entirety of the text can still be heard.
nyu: Pangakhala patazika kukoyiwa kwa mafala nkaseti ayayi pangakhala pawoneka baludya, lambani, mungabvume pinango pangakhala pakubveka mwabwino falawo.

source: If there is additional information you want to provide about this file, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
nyu: Pangakhala panamphangwa zinango zomwe imwe munfuna kutiwuza zomwe ndi za sagudhu ya mphangwa yanu, lewani na ife umu <emailFragment>commonvoice@mozilla.com</emailFragment>

source: If there is additional information you want to provide about this file that is not included in the template, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
nyu: Pangakhala panamphangwa zinango zomwe imwe munfuna kutiwuza zomwe ndi za musagudhu ya mphangwa yanu, zomwe ziribe kuyikhiwa mumaphatidwe ya basa yathu, lewani na ife umu <emailFragment>commonvoice@mozilla.com</emailFragment>

source: If the sentence does not meet the above criteria, click the &quot;Reject&quot; button on the left. If you are unsure about the sentence, you may also skip it and move on to the next one.
nyu: Pangakhaka kuti nfolo-fala ukutoweza masankhuliro awa, tinya pa butawu &quot;Kulamba&quot; ku madzere. Ngakhala mukudziwa lini bwinobwino kwa nfolo-falawo, imwe mungamoge kuyenda kunfolo-fala anango.

source: If the sentence meets the criteria, click the &quot;Approve&quot; button on the right.
nyu: Pangakhaka kuti nfolo-fala ukutoweza masankhuliro awa, tinya pa butawu &quot;Kubvumiza&quot; ku madidi.

source: If you come across something that these guidelines don’t cover, please vote according to your best judgement. If you really can’t decide, use the skip button and go on to the next recording.
nyu: Mungakhala mwawonekedwa na bzinthu bzomwe bzingalingane lini na bzinhtu ninga ibzi, sankhulani malingane na mawonero anu. Mungatazira kusakhuula, tinyani tobo moga muciyenda kukaseti inango.

source: If you run out of sentences to review, please help us collect more sentences!
nyu: Imwe mungasaya mifolo-fala kuti mubwerezere, tithandizeni kuyikha mifolo-fala inango!

source: Include appropriate citation
nyu: Kunemba bza cadidi komwe mudatenga mphangwa

source: Invalid file
nyu: Sagudhu ya mphangwa iri lini bwino

source: It contains words or phrases that are hard to read or pronounce.
nyu: Iwo una mafala ayayi tumifolo-fala tomwe tinawerengeka lini neye kuleweka.

source: It is written in a language different than what I’m reviewing.
nyu: Idanembiwa na cilewedwe cinango cakusiyana na cilewedwe comwe ndikubwerezera.

source: It is written in a language different than what I’m speaking.
nyu: Iwo wanembedwa na cilewedwe comwe ndikulewa.

source: Just Unsure?
nyu: Imwe muna cadidi?

source: Keep it up, record again <recordIcon></recordIcon>
nyu: Pitirizani tenepayi, koyani pomwe fala nkaseti <recordIcon></recordIcon>

source: Keep the recordings
nyu: Kusiya makasetin yomwe adakoyiwa

source: Keep track of your progress with a profile
nyu: Bvaya na kuwona kuyenderera kwa mabasawa na dzina yanu

source: Language Fundamentals (e.g. Digits, Letters, Money)
nyu: Mbali ya bzilewedwe (ninga, ubodzi, nembo, kobiri)

source: Languages
nyu: Bzilewedwe

source: Large bulk sentence submission
nyu: Kutumiziwa kwa magulu ya mifolo-fala

source: Learn More
nyu: Dziwa pomwe

source: Leaving now means you'll lose your progress
nyu: Mungayimira tsapano munaluza piwonsene piwomwe mukukoya

source: Listen
nyu: Kubva

source: Listen options menu
nyu: Kanyumba ka cisankhu ca kubva

source: Loading sentences…
nyu: Kubulusa mifolo-fala

source: <loginLink>Login</loginLink> or <loginLink>sign up</loginLink> to add multiple sentences
nyu: <loginLink>Pitani na dzina yanu</loginLink> ayayi <loginLink> kondzani umu</loginLink> kuti muyikhe mifolo-fala ya kusiyanasiyana

source: Log in or sign up to get started
nyu: Gumanani ayayi pitani na dzina yanu kuti mutome

source: Log In / Sign Up
nyu: Pitani/ Bzinembeni dzina lanu

source: Make sure the sentence meets the following criteria:
nyu: Phatisani kuti nfolo-fala una misankhulo iyi:

source: Maximum file size: 25 MB
nyu: Sagudhu wa mphangwa yomwe ina: 25 MB

source: Media and Entertainment
nyu: Mbali ya bzakusekesa, kuyimba na kumwaziwa kwa mphangwa

source: Minimum sentences in file: 1000
nyu: Inabvimiziwa mifolo-fala ya kutoma: 1000 kuyenda kutsogolo

source: [Mismatched content]
nyu: [Ndi mafala lini]

source: Misreadings
nyu: Kuwerenga kwakuyipa

source: Missing an <strong>'s'</strong> at the end of a word.
nyu: Kusayika <strong>'s'</strong> kwakumalizira kwa fala ibodzi.

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
nyu: Kusayika kwa <strong>'mbodzi'</strong> ayayi <strong>'O'</strong> pakuyamba kwa kukoyiwa kwa fala nkaseti.

source: Missing the end of the last word by cutting off the recording too quickly.
nyu: Kusaya kwakuwoneka fala ya kumalizira na thangwera ya kukoyiwa nkamangu kwa fala nkaseti.

source: [More has been recorded than the required text]
nyu: [Pakoyiya matsamba azinji anagno mbakufunika lini]

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
nyu: Makaseti azinji mba anthu kulewa bzinthu ninga adabadwa. Imwe mungabvume kaseti yomwe idakoyiwa mwakusaya kulewa kwa cibadwe, yomwe idalewedwa ‘mwakuseka’. Lambani kaseti yomwe inamafala yomwe adawadekesa na nchini wa ndzeru.

source: Nature and Environment
nyu: Bzakubadwa na bzire bzomwe bzidatizungulira

source: News and Current Affairs
nyu: Mphangwa na bzatsapano

source: No
nyu: Neye

source: [No ‘a’ in the original text]
nyu: [Kucosa ‘kuti wa patsamba cayico]

source: <noCopyright>No copyright</noCopyright> restrictions (cc-0)
nyu: <noCopyright>Ya kusaya kulewa komwe udatemnga miflo-fala ayayi yomwe iribve mwinikaciro</noCopyright> (cc-0)

source: No foreign letters
nyu: Kusaya manembo ya cilewedwe cinango

source: No microphone found.
nyu: Palibe kugumaniwa ayayi kuwoneka mikorofoni.

source: No numbers and special characters
nyu: Kusaya miwengo na mathotho ya cayico

source: No sentences to review. <addLink>Add more sentences now!</addLink>
nyu: Palibe nfolo-fala wakubwerezera. <addLink>Ikhani pomwe mifolo-fala inango tsapano!</addLink>

source: No thanks, continue speaking
nyu: Neye, ndatenda, pitirizani kulewalewa

source: Offensive language
nyu: Malewedwe yawene ndi yakupusa.

source: Offensive speech
nyu: Kulewa kwa kutukana

source: On desktop devices you can contribute by downloading…
nyu: Munchini ya ndzeru, imwe mungachitise comwe ndi catsapano:

source: On his head he wore a beret.
nyu: Mulumbwana akhabvala capewu.

source: On iOS please continue with Safari to enable recording…
nyu: Ku iOS, pitirizani na Safari kuti mutobole kuyamba kwa kukoya fala nkaseti…

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
nyu: Mbali inango, mungatonge muwerengi , iye angakhale pinango akanati kubva kale fala lomwe iye akuwerenga mwakutaza, lambani. Mungakhale mudziwa lini mwabwino tinyani tobo wa kumoga.

source: p
nyu: r

source: Partner
nyu: Mwandzako

source: [Part of the text can’t be heard]
nyu: [Mbali la tsamba la nkhani lomwe lingabvedwe lini]

source: <playIcon></playIcon>Last one!
nyu: <playIcon></playIcon> Kwakumaliza!

source: Play/Stop
nyu: Kukhuya/Kuyima

source: Please check our <templateFileLink>template file</templateFileLink>. Your sentences should be copyright free (CC0 or permissioned original work by the submitter) and be clear, grammatically correct and easy to read. Submitted sentences should take roughly 10-15 seconds to read and should avoid including numbers, proper nouns and special characters.
nyu: Wonesesasa<templateFileLink>khalidwe ya sagudhu wathu</templateFileLink>. Mifolo-fala yanu infunika kuti ikhale ya kusaya mwinikaciro ( lisensa ya CC0 ayayi basa yomwe idabvumizidwa na ule omwe adatumiza) ndipo palewedwe bzakuveseseka, kuteweza ntemo wa cilewedwe na kuwerengedwa mwabwinobwino. Mafala yakutumizidwa yakhale ya tumphindi ayayi segundo ya kuyambira 10 mpaka kufikira 15 za segundo pasayike kuwoneka miwerengo, madzina ya wanthu na mathotho yomwe ndiwo lini.

source: Please fill out this field.
nyu: Dzaza mbuto iyi

source: Please select a language to review sentences.
nyu: Sankhulani cilewedwe cibodzi kuti mubwerezere mifolo-fala.

source: [‘Raised’ in English is always pronounced as one syllable, not two]
nyu: [‘ako’ n‘cizungu asawerengiwa ninga gawo wa fala ubodzi, neye ninga awiri ]

source: Rate limit exceeded. Try again in { $retryLimit } minutes
nyu: Nthawe ya kutimuza yamala. Yezerani nthawe inango { $retryLimit } mphindi

source: Rate limit exceeded. Try again in { $retryLimit } seconds
nyu: Nthawe ya kutimuza yamala. Yezerani nthawe inango nkati mwa { $retryLimit } tumphindi/segundo

source: Reader Effects
nyu: Macitiko ya muwerengi

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
nyu: Mawerengo yomwe alibe kunembiwa patsamba, ninga "yam' dzi" pomwe padanembiwa "ya madzi" ninga tenepa.

source: Read Sentences
nyu: Kuwerenga mfilo-fala

source: Read Sentences, Answer Questions
nyu: Kuwerenga mifolo-fala, kutawira mibvundzo

source: Read Sentences <small>(Coming soon)</small>
nyu: Kuwerenga mifolo-fala <small>(tsapano)</small>

source: Read sentences submitted by the community in various languages
nyu: Kuwerenga mifolo-fala yomwe idatumiziwa na wanthu wa ncisa mu bzilewedwe bzawo

source: Ready to do { $count } more?
nyu: Mungacite pomwe { $count }?

source: <recordIcon></recordIcon> Last one!
nyu: <recordIcon></recordIcon> kwakumalizira!

source: [Recording cut off before the end of the last word]
nyu: [Kuyimisiwa kwa kukoya fala nkaseti pomwe pakanati kumaliwa fala ya kumalizira]

source: Record/Stop
nyu: Kukoya fala n‘gwangwa ya fala/kuyima

source: Record yourself reading sentences in your language
nyu: Kukoya fala yanu mwenka nkaseti muciwerenga mifilo-fala na cilewedwe canu

source: Record yourself responding to questions and prompts in your language
nyu: Kukoya fala yanu mwenka nkaseti mucitawira mibvundzo na ubvundzo mu cilewedwe canu

source: Record your voice
nyu: Koya fala yako mugwangwa ya fala.

source: Reference the source of your sentence (required)
nyu: Lewani komwe mudakatenga mifolo-falayo (ndibzakufunika kwenekwene)

source: Reject
nyu: Kulamba

source: Report
nyu: Kulewa bzomwe bzidacitika

source: Report was passed successfully
nyu: Bzakucitika bzatumizidwa mwabwino

source: Request a Language
nyu: Kumbira cilewedwe cibodzi

source: Re-record
nyu: Kukoya pomwe kaseti

source: Re-record clip
nyu: Kubwereza kukoya fala n‘ gwangwa ya fala mukaseti

source: Return
nyu: Kubwerezera

source: Review
nyu: Bwerezera
